"""
Урок 7. Python: от простого к практике
Задание в группах: Создать телефонный справочник с возможностью 
импорта и экспорта данных в нескольких форматах. (Применить MVC)

ТЗ:
Операции с телефонным справочником:
1. Вывод контактов
2. Добавление контакта ФИО и телефон
3. Удаление контакта
4. Поиск контакта по имени и вывести список найденных контактов с заданным именем
5. Выгрузка в формате CSV, txt или JSON (экспорт)
6. Загрузка списка контактов из файлика выбранного формата
7. Редактирование контакта

Пример структуры:
contacts = [
{ "fio": "ivan petrov", "phone": "12345 },
{ "fio": "max petrov", "phone": "12333345 },
....
]
"""

import td_controller as td_c

print('Телефонный справочник:')
print('----------------------')
td_c.manager(non_zero=True)
